import { Injectable } from '@angular/core';

@Injectable()
export class VendorsService {
  vendors: any[] = [
    {
      title: 'Fortinet',
      routerLink: '/company/vendors/fortinet',
      imageSrc: 'assets/vendors/1.gif',
      description: 'Fortinet – признанный лидер рынка унифицированного управления угрозами' +
      ' (UTM) и всемирный производитель многофункциональных устройств сетевой безопасности, эффективно защищающих,' +
      ' в том числе и от современных комбинированных многоуровневых атак. Интегрированные средства Fortinet позволяют' +
      ' объединить в одном устройстве все технологии обеспечения безопасности, обеспечивая экономически эффективную' +
      ' комплексную защиту сетевой инфраструктуры от различных типов угроз без ущерба для производительности.'
    },
    {
      title: 'Fortinet',
      routerLink: '/company/vendors/fortinet',
      imageSrc: 'assets/vendors/1.gif',
      description: 'Fortinet – признанный лидер рынка унифицированного управления угрозами' +
      ' (UTM) и всемирный производитель многофункциональных устройств сетевой безопасности, эффективно защищающих,' +
      ' в том числе и от современных комбинированных многоуровневых атак. Интегрированные средства Fortinet позволяют' +
      ' объединить в одном устройстве все технологии обеспечения безопасности, обеспечивая экономически эффективную' +
      ' комплексную защиту сетевой инфраструктуры от различных типов угроз без ущерба для производительности.'
    },
    {
      title: 'Fortinet',
      routerLink: '/company/vendors/fortinet',
      imageSrc: 'assets/vendors/1.gif',
      description: 'Fortinet – признанный лидер рынка унифицированного управления угрозами' +
      ' (UTM) и всемирный производитель многофункциональных устройств сетевой безопасности, эффективно защищающих,' +
      ' в том числе и от современных комбинированных многоуровневых атак. Интегрированные средства Fortinet позволяют' +
      ' объединить в одном устройстве все технологии обеспечения безопасности, обеспечивая экономически эффективную' +
      ' комплексную защиту сетевой инфраструктуры от различных типов угроз без ущерба для производительности.'
    },
    {
      title: 'Fortinet',
      routerLink: '/company/vendors/fortinet',
      imageSrc: 'assets/vendors/1.gif',
      description: 'Fortinet – признанный лидер рынка унифицированного управления угрозами' +
      ' (UTM) и всемирный производитель многофункциональных устройств сетевой безопасности, эффективно защищающих,' +
      ' в том числе и от современных комбинированных многоуровневых атак. Интегрированные средства Fortinet позволяют' +
      ' объединить в одном устройстве все технологии обеспечения безопасности, обеспечивая экономически эффективную' +
      ' комплексную защиту сетевой инфраструктуры от различных типов угроз без ущерба для производительности.'
    },
    {
      title: 'Fortinet',
      routerLink: '/company/vendors/fortinet',
      imageSrc: 'assets/vendors/1.gif',
      description: 'Fortinet – признанный лидер рынка унифицированного управления угрозами' +
      ' (UTM) и всемирный производитель многофункциональных устройств сетевой безопасности, эффективно защищающих,' +
      ' в том числе и от современных комбинированных многоуровневых атак. Интегрированные средства Fortinet позволяют' +
      ' объединить в одном устройстве все технологии обеспечения безопасности, обеспечивая экономически эффективную' +
      ' комплексную защиту сетевой инфраструктуры от различных типов угроз без ущерба для производительности.'
    },
    {
      title: 'Fortinet',
      routerLink: '/company/vendors/fortinet',
      imageSrc: 'assets/vendors/1.gif',
      description: 'Fortinet – признанный лидер рынка унифицированного управления угрозами' +
      ' (UTM) и всемирный производитель многофункциональных устройств сетевой безопасности, эффективно защищающих,' +
      ' в том числе и от современных комбинированных многоуровневых атак. Интегрированные средства Fortinet позволяют' +
      ' объединить в одном устройстве все технологии обеспечения безопасности, обеспечивая экономически эффективную' +
      ' комплексную защиту сетевой инфраструктуры от различных типов угроз без ущерба для производительности.'
    },
    {
      title: 'Fortinet',
      routerLink: '/company/vendors/fortinet',
      imageSrc: 'assets/vendors/1.gif',
      description: 'Fortinet – признанный лидер рынка унифицированного управления угрозами' +
      ' (UTM) и всемирный производитель многофункциональных устройств сетевой безопасности, эффективно защищающих,' +
      ' в том числе и от современных комбинированных многоуровневых атак. Интегрированные средства Fortinet позволяют' +
      ' объединить в одном устройстве все технологии обеспечения безопасности, обеспечивая экономически эффективную' +
      ' комплексную защиту сетевой инфраструктуры от различных типов угроз без ущерба для производительности.'
    },
    {
      title: 'Fortinet',
      routerLink: '/company/vendors/fortinet',
      imageSrc: 'assets/vendors/1.gif',
      description: 'Fortinet – признанный лидер рынка унифицированного управления угрозами' +
      ' (UTM) и всемирный производитель многофункциональных устройств сетевой безопасности, эффективно защищающих,' +
      ' в том числе и от современных комбинированных многоуровневых атак. Интегрированные средства Fortinet позволяют' +
      ' объединить в одном устройстве все технологии обеспечения безопасности, обеспечивая экономически эффективную' +
      ' комплексную защиту сетевой инфраструктуры от различных типов угроз без ущерба для производительности.'
    },
    {
      title: 'Fortinet',
      routerLink: '/company/vendors/fortinet',
      imageSrc: 'assets/vendors/1.gif',
      description: 'Fortinet – признанный лидер рынка унифицированного управления угрозами' +
      ' (UTM) и всемирный производитель многофункциональных устройств сетевой безопасности, эффективно защищающих,' +
      ' в том числе и от современных комбинированных многоуровневых атак. Интегрированные средства Fortinet позволяют' +
      ' объединить в одном устройстве все технологии обеспечения безопасности, обеспечивая экономически эффективную' +
      ' комплексную защиту сетевой инфраструктуры от различных типов угроз без ущерба для производительности.'
    },
    {
      title: 'Fortinet',
      routerLink: '/company/vendors/fortinet',
      imageSrc: 'assets/vendors/1.gif',
      description: 'Fortinet – признанный лидер рынка унифицированного управления угрозами' +
      ' (UTM) и всемирный производитель многофункциональных устройств сетевой безопасности, эффективно защищающих,' +
      ' в том числе и от современных комбинированных многоуровневых атак. Интегрированные средства Fortinet позволяют' +
      ' объединить в одном устройстве все технологии обеспечения безопасности, обеспечивая экономически эффективную' +
      ' комплексную защиту сетевой инфраструктуры от различных типов угроз без ущерба для производительности.'
    },
    {
      title: 'Fortinet',
      routerLink: '/company/vendors/fortinet',
      imageSrc: 'assets/vendors/1.gif',
      description: 'Fortinet – признанный лидер рынка унифицированного управления угрозами' +
      ' (UTM) и всемирный производитель многофункциональных устройств сетевой безопасности, эффективно защищающих,' +
      ' в том числе и от современных комбинированных многоуровневых атак. Интегрированные средства Fortinet позволяют' +
      ' объединить в одном устройстве все технологии обеспечения безопасности, обеспечивая экономически эффективную' +
      ' комплексную защиту сетевой инфраструктуры от различных типов угроз без ущерба для производительности.'
    },
    {
      title: 'Fortinet',
      routerLink: '/company/vendors/fortinet',
      imageSrc: 'assets/vendors/1.gif',
      description: 'Fortinet – признанный лидер рынка унифицированного управления угрозами' +
      ' (UTM) и всемирный производитель многофункциональных устройств сетевой безопасности, эффективно защищающих,' +
      ' в том числе и от современных комбинированных многоуровневых атак. Интегрированные средства Fortinet позволяют' +
      ' объединить в одном устройстве все технологии обеспечения безопасности, обеспечивая экономически эффективную' +
      ' комплексную защиту сетевой инфраструктуры от различных типов угроз без ущерба для производительности.'
    }
  ];
  constructor() { }
  getVendors() {
    return this.vendors;
  }
  findVendor(vendorName: string) {
    return this.vendors.find(vendor => {
      return vendor.title.toUpperCase() === vendorName.toUpperCase();
    });
  }
}
